app/Controllers/Auth.php

INSERT INTO `users` (`first_name`, `last_name`, `email`, `password`, `time_created`) VALUES ('Maria', 'Clara', 'mariac@email.com', '$2y$10$cUvft/pI2I7Wgi4uk0Y7pOPuEL.yfaYCdP/CwMJ2..DYeeYk7X6xm', '2022-09-23 01:48:37')
---
  public function signup($page = 'Signup')
  {
    $data['title'] = ucfirst($page);

    if (strtolower($this->request->getMethod()) !== 'post') {
      return view('templates/header', $data) .
        view('auth/login', [
          'validation' => Services::validation(),
        ]);
    }

    $rules = [
      'firstName' => 'required',
      'lastName' => 'required',
      'email' => 'required|valid_email|is_unique[users.email]',
      'password' => 'required',
      'repeatPassword' => 'required|matches[password]',
    ];

    if (!$this->validate($rules)) {
      return view('templates/header', $data) .
        view('auth/login', [
          'validation' => $this->validator,
        ]);
    }

    $model = model(UserModel::class);

    if ($this->request->getMethod() === 'post' && $this->validate($rules)) {
      $model->save([
        'first_name' => $this->request->getPost('firstName'),
        'last_name'  => $this->request->getPost('lastName'),
        'email'  => $this->request->getPost('email'),
        'password'  => password_hash($this->request->getPost('password'), PASSWORD_DEFAULT),
      ]);

SELECT *
FROM `users`
WHERE `email` = 'jdc@email.com'
 LIMIT 1
---
  public function login()
  {
    $session = session();
    $model = new UserModel();
    $email = $this->request->getPost('email');
    $password = $this->request->getPost('password');

    $data  = $model->where('email', $email)->first();