app/Controllers/Home.php

    public function uploadFile()
    {
        $data['title'] = ucfirst('File Upload');
        $session = session();


        if (strtolower($this->request->getMethod()) !== 'post') {
            return 'Failed';
        }

        $rules = [
            'fileInput' => 'uploaded[fileInput]',
        ];

        if (!$this->validate($rules)) {
            return 'Failed';
        }

        $model = model(FileModel::class);

        if ($this->request->getMethod() === 'post' && $this->validate($rules)) {

            $file = $this->request->getFile('fileInput');
            $fileName = $file->getName();
            $newName = $file->getRandomName();
            $file->move('uploads/' . $session->get('id'), $newName);
            $fileLocation = 'uploads/' . $session->get('id') . '/' . $newName;

            $model->save([
                'file_name' => $fileName,
                'uploader_id'  => $session->get('id'),
                'file_size'  => $file->getSizeByUnit('mb'),
                'location'  => $fileLocation
            ]);
---
INSERT INTO `files` (`file_name`, `uploader_id`, `file_size`, `location`, `date_uploaded`) VALUES ('1.png', '3', '0.034', 'uploads/3/1664032394_04cd4dc90af07ec8e16d.png', '2022-09-24 10:13:14')