app/Models/FileModel.php

SELECT *
FROM `files`
---
  public function getFiles($id = false)
  {
    $this->table = 'files_with_user';
    if ($id === false) {
      return $this->findAll();