app/Models/UserModel.php

SELECT *
FROM `users`
SELECT *
FROM `users`
WHERE `id` IS NULL
 LIMIT 1
---
  public function getUsers($id = false)
  {
    if ($id === false) {
      return $this->findAll();
    }

    return $this->where(['id' => $id])->first();